Revit 2027 API
MEPAnalyticalSegment.RevitElementId Property
 The id of the owning Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId RevitElementId { get; }
Public ReadOnly Property RevitElementId As ElementId
	Get
public:
property ElementId^ RevitElementId {
	ElementId^ get ();
}
member RevitElementId : ElementId with get
Property Value
ElementId
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace